#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/private_server/private_server/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/private_server/private_server

To view this run in a browser, visit:
https://app.terraform.io/app/redline/private_server/runs/run-Cs6yRiadzHE6jspT

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.personal_domain: Refreshing state... [id=cee2af2644f6a3325416173e2d4b44f7]
hcloud_ssh_key.ansible: Refreshing state... [id=8957821]
hcloud_firewall.web_firewall: Refreshing state... [id=603891]
cloudflare_record.aliases["grocy"]: Refreshing state... [id=1a98a4348007c72461ab6752f2c7f9df]
cloudflare_record.aliases["grafana"]: Refreshing state... [id=a63efd438a1e819f0e4215e4835a0f24]
cloudflare_record.aliases["photoprism"]: Refreshing state... [id=6c61639959eeaf8d547dd411419bcf9a]
cloudflare_record.aliases["traefik"]: Refreshing state... [id=efbdd0b7c842cec43a43af72a450fcc0]
cloudflare_record.aliases["ldap"]: Refreshing state... [id=416e67a40f89597f342029d943e253ed]
cloudflare_record.aliases["auth"]: Refreshing state... [id=59a6c353a0138b64113ad34f046c17dc]
hcloud_server.web: Refreshing state... [id=51760523]
hcloud_volume.data: Refreshing state... [id=24743811]
hcloud_firewall_attachment.firewall_assignments: Refreshing state... [id=603891]
cloudflare_record.aaaa: Refreshing state... [id=1f54f8a3794295291a1b5a18ed363416]
cloudflare_record.a: Refreshing state... [id=a44b3519c0443db244e9f2dc5bba8a91]
cloudflare_record.aaaa: Drift detected (delete)
hcloud_firewall.web_firewall: Drift detected (update)
hcloud_server.web: Drift detected (update)
cloudflare_record.aliases["photoprism"]: Drift detected (delete)
cloudflare_record.aliases["traefik"]: Drift detected (delete)
cloudflare_record.aliases["auth"]: Drift detected (delete)
cloudflare_record.aliases["grafana"]: Drift detected (delete)
cloudflare_record.aliases["grocy"]: Drift detected (delete)
cloudflare_record.aliases["ldap"]: Drift detected (delete)
cloudflare_record.a: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.a will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + content         = "78.47.192.97"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pascal.build"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aaaa will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + content         = "2a01:4f8:c2c:1ff1::1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pascal.build"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["auth"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "auth"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["grafana"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grafana"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["grocy"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grocy"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["ldap"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ldap"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["photoprism"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "photoprism"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aliases["traefik"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + content         = "pascal.build"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "traefik"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`*